scores = {
    "西都 太郎": {'ゆか': 14.372, 'あん馬': 13.986, 'つり輪': 15.492, '跳馬': 14.193, '平行棒': 15.241, '鉄棒': 14.547},
    "日南 一馬": {'ゆか': 14.031, 'あん馬': 16.304, 'つり輪': 16.335, '跳馬': 13.362, '平行棒': 15.746, '鉄棒': 14.811},
    "延岡 大輔": {'ゆか': 16.461, 'あん馬': 15.358, 'つり輪': 13.761, '跳馬': 12.029, '平行棒': 13.496, '鉄棒': 14.896},
    "都城 翔": {'ゆか': 15.149, 'あん馬': 13.53, 'つり輪': 15.222, '跳馬': 12.594,'平行棒': 15.746, '鉄棒': 14.811},
    "小林 颯太": {'ゆか': 15.797, 'あん馬': 16.477, 'つり輪': 13.189, '跳馬': 15.537, '平行棒': 16.298, '鉄棒': 15.354,},
    "高鍋 悠斗": {'ゆか': 16.22, 'あん馬': 13.119, 'つり輪': 15.112, '跳馬': 13.957, '平行棒': 14.48, '鉄棒': 12.896},
    "串間 海斗": {'ゆか': 16.295, 'あん馬': 15.123, 'つり輪': 13.033, '跳馬': 12.433, '平行棒': 13.787, '鉄棒': 12.263},
    "えびの 陸": {'ゆか': 15.192, 'あん馬': 16.413, 'つり輪': 12.956, '跳馬': 15.347, '平行棒': 16.482, '鉄棒': 14.635},  
    "日向 智也": {'ゆか': 14.337, 'あん馬': 12.011, 'つり輪': 13.167, '跳馬': 15.259, '平行棒': 14.65, '鉄棒': 15.176},
    "三股 直人": {'ゆか': 14.08, 'あん馬': 16.062, 'つり輪': 16.259, '跳馬': 12.665, '平行棒': 15.13, '鉄棒': 14.374},
    "高千穂 光": {'ゆか': 16.309, 'あん馬': 16.448, 'つり輪': 15.996, '跳馬': 13.721, '平行棒': 13.543, '鉄棒': 13.067},
    "新富 慎太郎": {'ゆか': 15.982, 'あん馬': 15.757, 'つり輪': 16.24, '跳馬': 14.92, '平行棒': 15.065, '鉄棒': 13.418},
    "木城 亮": {'ゆか': 15.267, 'あん馬': 13.391, 'つり輪': 14.177, '跳馬': 14.139, '平行棒': 13.829, '鉄棒': 15.745},
    "川南 俊介": {'ゆか': 12.389, 'あん馬': 13.02, 'つり輪': 13.97, '跳馬': 13.39, '平行棒': 14.122, '鉄棒': 13.489},
    "門川 直樹": {'ゆか': 12.599, 'あん馬': 12.781, 'つり輪': 15.236, '跳馬': 15.518, '平行棒': 15.828, '鉄棒': 14.487},
    "美郷 亮太": {'ゆか': 14.643, 'あん馬': 12.388, 'つり輪': 12.179, '跳馬': 13.401, '平行棒': 15.571, '鉄棒': 13.073},
    "椎葉 大地": {'ゆか': 14.852, 'あん馬': 13.469, 'つり輪': 14.268, '跳馬': 12.085, '平行棒': 16.454, '鉄棒': 13.323},
    "諸塚 慎吾": {'ゆか': 15.299, 'あん馬': 13.772, 'つり輪': 12.184, '跳馬': 15.689, '平行棒': 15.371, '鉄棒': 16.244}, 
    "五ヶ瀬 颯": {'ゆか': 16.004, 'あん馬': 12.06, 'つり輪': 14.908, '跳馬': 15.35, '平行棒': 15.726, '鉄棒': 16.428},
    "国富 拓海": {'ゆか': 13.332, 'あん馬': 12.757, 'つり輪': 15.874, '跳馬': 14.501, '平行棒': 16.365, '鉄棒': 15.278}
}

# 合計得点を計算
totals = []
for name, events in scores.items():
    total = sum(events.values())
    totals.append([name, total])

# バブルソート（降順）
n = len(totals)
for i in range(n):
    for j in range(n - 1 - i):
        if totals[j][1] < totals[j + 1][1]:
            totals[j], totals[j + 1] = totals[j + 1], totals[j]

# 結果表示
for name, total in totals:
    print(f"{name}: {total:.3f}")